app/controllers/videos_controller.rb

	def index
		@videos = Video.order('created_at Desc')
---
SELECT  "videos".* FROM "videos" ORDER BY created_at Desc LIMIT ?  [["LIMIT", 1]]

	def create
		# p @video = YT::Video.new(url: 'https://www.youtube.com/watch?v=m_cZfV-IiAw')
		@video = Video.new(video_params)
		p "@@@@@@@@@@@@@@@@@"
		if @video.save
---
INSERT INTO "videos" ("link", "created_at", "updated_at") VALUES (?, ?, ?)  [["link", "https://www.youtube.com/watch?v=si2stxyxQ_k"], ["created_at", 2016-09-12 18:18:11 UTC], ["updated_at", 2016-09-12 18:18:11 UTC]]